blogger/app/controllers/articles_controller.rb

  def show
    @article = Article.find(params[:id]) rescue nil
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]